OpenSourceEBike/Bafang_M500_M600/Hardware/Controller/S32_SDK_S32K1xx_RTM_4.0.2/middleware/sbc/sbc_uja116x/include/sbc_uja116x_map.h
/*!
 * @brief   Mask 0x2d - M23:M16 macros.
 */
#define SBC_UJA_MASK_2316_MASK               (0xFFU)
#define SBC_UJA_MASK_2316_SHIFT              (0U)
#define SBC_UJA_MASK_2316_F(x)               ((uint8_t)((uint8_t)(x)<<SBC_UJA_MASK_2316_SHIFT)&SBC_UJA_MASK_2316_MASK)

/*!
 * @brief   Mask 0x2e - M28:M24 macros.
 */
#define SBC_UJA_MASK_2824_MASK               (0x1FU)
#define SBC_UJA_MASK_2824_SHIFT              (0U)
#define SBC_UJA_MASK_2824_F(x)               ((uint8_t)((uint8_t)(x)<<SBC_UJA_MASK_2824_SHIFT)&SBC_UJA_MASK_2824_MASK)

/*!
 * @brief   Mask X macros (0x2b-0x2e).
 */
#define SBC_UJA_MASK_X_MASK                  (0xFFU)
#define SBC_UJA_MASK_X_SHIFT                 (0U)
#define SBC_UJA_MASK_X_F(x)                  ((uint8_t)((uint8_t)(x)<<SBC_UJA_MASK_X_SHIFT)&SBC_UJA_MASK_X_MASK)

/*!
 * @brief  Frame control register, identifier format macros.
 */
#define SBC_UJA_FRAME_CTR_IDE_MASK           (0x80U)
#define SBC_UJA_FRAME_CTR_IDE_SHIFT          (7U)
#define SBC_UJA_FRAME_CTR_IDE_F(x)           ((uint8_t)((uint8_t)(x)<<SBC_UJA_FRAME_CTR_IDE_SHIFT)&SBC_UJA_FRAME_CTR_IDE_MASK)

/*!
 * @brief  Frame control register, partial networking data mask macros.
 */
#define SBC_UJA_FRAME_CTR_PNDM_MASK          (0x40U)
#define SBC_UJA_FRAME_CTR_PNDM_SHIFT         (6U)
#define SBC_UJA_FRAME_CTR_PNDM_F(x)          ((uint8_t)((uint8_t)(x)<<SBC_UJA_FRAME_CTR_PNDM_SHIFT)&SBC_UJA_FRAME_CTR_PNDM_MASK)

/*!
 * @brief  Frame control register,  number of data bytes expected in a CAN frame macros.
 */
#define SBC_UJA_FRAME_CTR_DLC_MASK           (0x0FU)
#define SBC_UJA_FRAME_CTR_DLC_SHIFT          (0U)
#define SBC_UJA_FRAME_CTR_DLC_F(x)           ((uint8_t)((uint8_t)(x)<<SBC_UJA_FRAME_CTR_DLC_SHIFT)&SBC_UJA_FRAME_CTR_DLC_MASK)

/*!
 * @brief  Frame control register.
 */
#define SBC_UJA_FRAME_CTR_MASK               (SBC_UJA_FRAME_CTR_IDE_MASK | SBC_UJA_FRAME_CTR_PNDM_MASK \
		                                       | SBC_UJA_FRAME_CTR_DLC_MASK)
#define SBC_UJA_FRAME_CTR_SHIFT              (0U)
#define SBC_UJA_FRAME_CTR_F(x)               ((uint8_t)((uint8_t)(x)<<SBC_UJA_FRAME_CTR_SHIFT)&SBC_UJA_FRAME_CTR_MASK)

/*!
 * @brief  Data mask registers (0x68 to 0x6F) macros
 *         Data mask 0-7 configuration.
 */
#define SBC_UJA_DATA_MASK_X_MASK             (0xFFU)
#define SBC_UJA_DATA_MASK_X_SHIFT            (0U)
#define SBC_UJA_DATA_MASK_X_F(x)             ((uint8_t)((uint8_t)(x)<<SBC_UJA_DATA_MASK_X_SHIFT)&SBC_UJA_DATA_MASK_X_MASK)

/*!
 * @brief  WAKE pin status register, WAKE pin status macros.
 */
#define SBC_UJA_WAKE_STAT_WPVS_MASK          (0x02FU)
#define SBC_UJA_WAKE_STAT_WPVS_SHIFT         (1U)
#define SBC_UJA_WAKE_STAT_WPVS_F(x)          ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_STAT_WPVS_SHIFT)&SBC_UJA_WAKE_STAT_WPVS_MASK)

/*!
 * @brief  WAKE pin status register.
 */
#define SBC_UJA_WAKE_STAT_MASK               (SBC_UJA_WAKE_STAT_WPVS_MASK)
#define SBC_UJA_WAKE_STAT_SHIFT              (SBC_UJA_WAKE_STAT_WPVS_SHIFT)
#define SBC_UJA_WAKE_STAT_F(x)               ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_STAT_SHIFT)&SBC_UJA_WAKE_STAT_MASK)

/*!
 * @brief  WAKE pin event capture enable register,
 *         WAKE pin rising-edge enable macros.
 */
#define SBC_UJA_WAKE_EN_WPRE_MASK            (0x02U)
#define SBC_UJA_WAKE_EN_WPRE_SHIFT           (1U)
#define SBC_UJA_WAKE_EN_WPRE_F(x)            ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_EN_WPRE_SHIFT)&SBC_UJA_WAKE_EN_WPRE_MASK)

/*!
 * @brief  WAKE pin event capture enable register,
 *         WAKE pin falling-edge enable macros.
 */
#define SBC_UJA_WAKE_EN_WPFE_MASK            (0x01U)
#define SBC_UJA_WAKE_EN_WPFE_SHIFT           (0U)
#define SBC_UJA_WAKE_EN_WPFE_F(x)            ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_EN_WPFE_SHIFT)&SBC_UJA_WAKE_EN_WPFE_MASK)

/*!
 * @brief  WAKE pin event capture enable register macros.
 */
#define SBC_UJA_WAKE_EN_MASK                 (SBC_UJA_WAKE_EN_WPRE_MASK | SBC_UJA_WAKE_EN_WPFE_MASK)
#define SBC_UJA_WAKE_EN_SHIFT                (0U)
#define SBC_UJA_WAKE_EN_F(x)                 ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_EN_SHIFT)&SBC_UJA_WAKE_EN_MASK)

/*!
 * @brief  Global event status register, WAKE pin event macros.
 */
#define SBC_UJA_GL_EVNT_STAT_WPE_MASK        (0x08U)
#define SBC_UJA_GL_EVNT_STAT_WPE_SHIFT       (3U)
#define SBC_UJA_GL_EVNT_STAT_WPE_F(x)        ((uint8_t)((uint8_t)(x)<<SBC_UJA_GL_EVNT_STAT_WPE_SHIFT)&SBC_UJA_GL_EVNT_STAT_WPE_MASK)

/*!
 * @brief  Global event status register, transceiver event macros.
 */
#define SBC_UJA_GL_EVNT_STAT_TRXE_MASK       (0x04U)
#define SBC_UJA_GL_EVNT_STAT_TRXE_SHIFT      (2U)
#define SBC_UJA_GL_EVNT_STAT_TRXE_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_GL_EVNT_STAT_TRXE_SHIFT)&SBC_UJA_GL_EVNT_STAT_TRXE_MASK)

/*!
 * @brief  Global event status register, supply event macros.
 */
#define SBC_UJA_GL_EVNT_STAT_SUPE_MASK       (0x02U)
#define SBC_UJA_GL_EVNT_STAT_SUPE_SHIFT      (1U)
#define SBC_UJA_GL_EVNT_STAT_SUPE_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_GL_EVNT_STAT_SUPE_SHIFT)&SBC_UJA_GL_EVNT_STAT_SUPE_MASK)

/*!
 * @brief  Global event status register, system event macros.
 */
#define SBC_UJA_GL_EVNT_STAT_SYSE_MASK       (0x01U)
#define SBC_UJA_GL_EVNT_STAT_SYSE_SHIFT      (0U)
#define SBC_UJA_GL_EVNT_STAT_SYSE_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_GL_EVNT_STAT_SYSE_SHIFT)&SBC_UJA_GL_EVNT_STAT_SYSE_MASK)

/*!
 * @brief  Global event status register macros.
 */
#define SBC_UJA_GL_EVNT_STAT_MASK            (SBC_UJA_GL_EVNT_STAT_WPE_MASK | SBC_UJA_GL_EVNT_STAT_TRXE_MASK \
		                                       | SBC_UJA_GL_EVNT_STAT_SUPE_MASK | SBC_UJA_GL_EVNT_STAT_SYSE_MASK)
#define SBC_UJA_GL_EVNT_STAT_SHIFT           (0U)
#define SBC_UJA_GL_EVNT_STAT_F(x)            ((uint8_t)((uint8_t)(x)<<SBC_UJA_GL_EVNT_STAT_SHIFT)&SBC_UJA_GL_EVNT_STAT_MASK)

/*!
 * @brief  System event status register, power-on macros.
 */
#define SBC_UJA_SYS_EVNT_STAT_PO_MASK        (0x10U)
#define SBC_UJA_SYS_EVNT_STAT_PO_SHIFT       (4U)
#define SBC_UJA_SYS_EVNT_STAT_PO_F(x)        ((uint8_t)((uint8_t)(x)<<SBC_UJA_SYS_EVNT_STAT_PO_SHIFT)&SBC_UJA_SYS_EVNT_STAT_PO_MASK)

/*!
 * @brief  System event status register, overtemperature warning macros.
 */
#define SBC_UJA_SYS_EVNT_STAT_OTW_MASK       (0x04U)
#define SBC_UJA_SYS_EVNT_STAT_OTW_SHIFT      (2U)
#define SBC_UJA_SYS_EVNT_STAT_OTW_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_SYS_EVNT_STAT_OTW_SHIFT)&SBC_UJA_SYS_EVNT_STAT_OTW_MASK)

/*!
 * @brief  System event status register, SPI failure macros.
 */
#define SBC_UJA_SYS_EVNT_STAT_SPIF_MASK      (0x02U)
#define SBC_UJA_SYS_EVNT_STAT_SPIF_SHIFT     (1U)
#define SBC_UJA_SYS_EVNT_STAT_SPIF_F(x)      ((uint8_t)((uint8_t)(x)<<SBC_UJA_SYS_EVNT_STAT_SPIF_SHIFT)&SBC_UJA_SYS_EVNT_STAT_SPIF_MASK)

/*!
 * @brief  System event status register, watchdog failure macros.
 */
#define SBC_UJA_SYS_EVNT_STAT_WDF_MASK       (0x01U)
#define SBC_UJA_SYS_EVNT_STAT_WDF_SHIFT      (0U)
#define SBC_UJA_SYS_EVNT_STAT_WDF_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_SYS_EVNT_STAT_WDF_SHIFT)&SBC_UJA_SYS_EVNT_STAT_WDF_MASK)

/*!
 * @brief  System event status register macros.
 */
#define SBC_UJA_SYS_EVNT_STAT_MASK           (SBC_UJA_SYS_EVNT_STAT_PO_MASK | SBC_UJA_SYS_EVNT_STAT_OTW_MASK \
		                                       | SBC_UJA_SYS_EVNT_STAT_SPIF_MASK | SBC_UJA_SYS_EVNT_STAT_WDF_MASK)
#define SBC_UJA_SYS_EVNT_STAT_SHIFT          (0U)
#define SBC_UJA_SYS_EVNT_STAT_F(x)           ((uint8_t)((uint8_t)(x)<<SBC_UJA_SYS_EVNT_STAT_SHIFT)&SBC_UJA_SYS_EVNT_STAT_MASK)

/*!
 * @brief  Supply event status register, V2/VEXT overvoltage macros.
 */
#define SBC_UJA_SUP_EVNT_STAT_V2O_MASK       (0x04U)
#define SBC_UJA_SUP_EVNT_STAT_V2O_SHIFT      (2U)
#define SBC_UJA_SUP_EVNT_STAT_V2O_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_SUP_EVNT_STAT_V2O_SHIFT)&SBC_UJA_SUP_EVNT_STAT_V2O_MASK)

/*!
 * @brief  Supply event status register, V2/VEXT undervoltage macros.
 */
#define SBC_UJA_SUP_EVNT_STAT_V2U_MASK       (0x02U)
#define SBC_UJA_SUP_EVNT_STAT_V2U_SHIFT      (1U)
#define SBC_UJA_SUP_EVNT_STAT_V2U_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_SUP_EVNT_STAT_V2U_SHIFT)&SBC_UJA_SUP_EVNT_STAT_V2U_MASK)

/*!
 * @brief  Supply event status register, V1 undervoltage: macros.
 */
#define SBC_UJA_SUP_EVNT_STAT_V1U_MASK       (0x01U)
#define SBC_UJA_SUP_EVNT_STAT_V1U_SHIFT      (0U)
#define SBC_UJA_SUP_EVNT_STAT_V1U_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_SUP_EVNT_STAT_V1U_SHIFT)&SBC_UJA_SUP_EVNT_STAT_V1U_MASK)

/*!
 * @brief  Supply event status register macros.
 */
#define SBC_UJA_SUP_EVNT_STAT_MASK           (SBC_UJA_SUP_EVNT_STAT_V2O_MASK | SBC_UJA_SUP_EVNT_STAT_V2U_MASK \
		                                       | SBC_UJA_SUP_EVNT_STAT_V1U_MASK)
#define SBC_UJA_SUP_EVNT_STAT_SHIFT          (0U)
#define SBC_UJA_SUP_EVNT_STAT_F(x)           ((uint8_t)((uint8_t)(x)<<SBC_UJA_SUP_EVNT_STAT_SHIFT)&SBC_UJA_SUP_EVNT_STAT_MASK)

/*!
 * @brief  Transceiver event status register, partial networking frame
 *         detection error macros.
 */
#define SBC_UJA_TRANS_EVNT_STAT_PNFDE_MASK   (0x20U)
#define SBC_UJA_TRANS_EVNT_STAT_PNFDE_SHIFT  (5U)
#define SBC_UJA_TRANS_EVNT_STAT_PNFDE_F(x)   ((uint8_t)((uint8_t)(x)<<SBC_UJA_TRANS_EVNT_STAT_PNFDE_SHIFT)&SBC_UJA_TRANS_EVNT_STAT_PNFDE_MASK)

/*!
 * @brief  Transceiver event status register, CAN-bus status  macros.
 */
#define SBC_UJA_TRANS_EVNT_STAT_CBS_MASK     (0x10U)
#define SBC_UJA_TRANS_EVNT_STAT_CBS_SHIFT    (4U)
#define SBC_UJA_TRANS_EVNT_STAT_CBS_F(x)     ((uint8_t)((uint8_t)(x)<<SBC_UJA_TRANS_EVNT_STAT_CBS_SHIFT)&SBC_UJA_TRANS_EVNT_STAT_CBS_MASK)

/*!
 * @brief  Transceiver event status register, CAN failure.
 */
#define SBC_UJA_TRANS_EVNT_STAT_CF_MASK      (0x02U)
#define SBC_UJA_TRANS_EVNT_STAT_CF_SHIFT     (1U)
#define SBC_UJA_TRANS_EVNT_STAT_CF_F(x)      ((uint8_t)((uint8_t)(x)<<SBC_UJA_TRANS_EVNT_STAT_CF_SHIFT)&SBC_UJA_TRANS_EVNT_STAT_CF_MASK)

/*!
 * @brief  Transceiver event status register, CAN wake-up.
 */
#define SBC_UJA_TRANS_EVNT_STAT_CW_MASK      (0x01U)
#define SBC_UJA_TRANS_EVNT_STAT_CW_SHIFT     (0U)
#define SBC_UJA_TRANS_EVNT_STAT_CW_F(x)      ((uint8_t)((uint8_t)(x)<<SBC_UJA_TRANS_EVNT_STAT_CW_SHIFT)&SBC_UJA_TRANS_EVNT_STAT_CW_MASK)

/*!
 * @brief  Transceiver event status register macros.
 */
#define SBC_UJA_TRANS_EVNT_STAT_MASK         (SBC_UJA_TRANS_EVNT_STAT_PNFDE_MASK | SBC_UJA_TRANS_EVNT_STAT_CBS_MASK \
		                                       | SBC_UJA_TRANS_EVNT_STAT_CF_MASK | SBC_UJA_TRANS_EVNT_STAT_CW_MASK)
#define SBC_UJA_TRANS_EVNT_STAT_SHIFT        (0U)
#define SBC_UJA_TRANS_EVNT_STAT_F(x)         ((uint8_t)((uint8_t)(x)<<SBC_UJA_TRANS_EVNT_STAT_SHIFT)&SBC_UJA_TRANS_EVNT_STAT_MASK)

/*!
 * @brief  WAKE pin event status register, WAKE pin rising edge macros.
 */
#define SBC_UJA_WAKE_EVNT_STAT_WPR_MASK      (0x02U)
#define SBC_UJA_WAKE_EVNT_STAT_WPR_SHIFT     (1U)
#define SBC_UJA_WAKE_EVNT_STAT_WPR_F(x)      ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_EVNT_STAT_WPR_SHIFT)&SBC_UJA_WAKE_EVNT_STAT_WPR_MASK)

/*!
 * @brief  WAKE pin event status register, WAKE pin falling edge macros.
 */
#define SBC_UJA_WAKE_EVNT_STAT_WPF_MASK      (0x01U)
#define SBC_UJA_WAKE_EVNT_STAT_WPF_SHIFT     (0U)
#define SBC_UJA_WAKE_EVNT_STAT_WPF_F(x)      ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_EVNT_STAT_WPF_SHIFT)&SBC_UJA_WAKE_EVNT_STAT_WPF_MASK)

/*!
 * @brief  WAKE pin event status register macros.
 */
#define SBC_UJA_WAKE_EVNT_STAT_MASK          (SBC_UJA_WAKE_EVNT_STAT_WPR_MASK | SBC_UJA_WAKE_EVNT_STAT_WPF_MASK)
#define SBC_UJA_WAKE_EVNT_STAT_SHIFT         (0U)
#define SBC_UJA_WAKE_EVNT_STAT_F(x)          ((uint8_t)((uint8_t)(x)<<SBC_UJA_WAKE_EVNT_STAT_SHIFT)&SBC_UJA_WAKE_EVNT_STAT_MASK)

/*!
 * @brief   MTPNV status register, write counter status macros.
 */
#define SBC_UJA_MTPNV_STAT_WRCNTS_MASK       (0xFCU)
#define SBC_UJA_MTPNV_STAT_WRCNTS_SHIFT      (2U)
#define SBC_UJA_MTPNV_STAT_WRCNTS_F(x)       ((uint8_t)((uint8_t)(x)<<SBC_UJA_MTPNV_STAT_WRCNTS_SHIFT)&SBC_UJA_MTPNV_STAT_WRCNTS_MASK)

/*!
 * @brief   MTPNV status register, error correction code status.
 */
#define SBC_UJA_MTPNV_STAT_ECCS_MASK         (0x02U)
#define SBC_UJA_MTPNV_STAT_ECCS_SHIFT        (1U)
#define SBC_UJA_MTPNV_STAT_ECCS_F(x)         ((uint8_t)((uint8_t)(x)<<SBC_UJA_MTPNV_STAT_ECCS_SHIFT)&SBC_UJA_MTPNV_STAT_ECCS_MASK)

/*!
 * @brief   MTPNV status register, non-volatile memory programming status.
 */
#define SBC_UJA_MTPNV_STAT_NVMPS_MASK        (0x01U)
#define SBC_UJA_MTPNV_STAT_NVMPS_SHIFT       (0U)
#define SBC_UJA_MTPNV_STAT_NVMPS_F(x)        ((uint8_t)((uint8_t)(x)<<SBC_UJA_MTPNV_STAT_NVMPS_SHIFT)&SBC_UJA_MTPNV_STAT_NVMPS_MASK)

/*!
 * @brief   MTPNV status register macros.
 */
#define SBC_UJA_MTPNV_STAT_MASK              (SBC_UJA_MTPNV_STAT_WRCNTS_MASK | SBC_UJA_MTPNV_STAT_ECCS_MASK \
                                         | SBC_UJA_MTPNV_STAT_NVMPS_MASK)
#define SBC_UJA_MTPNV_STAT_SHIFT             (0U)
#define SBC_UJA_MTPNV_STAT_F(x)              ((uint8_t)((uint8_t)(x)<<SBC_UJA_MTPNV_STAT_SHIFT)&SBC_UJA_MTPNV_STAT_MASK)

/*!
 * @brief   Start-up control register, RSTN output reset pulse width macros.
 */
#define SBC_UJA_START_UP_RLC_MASK            (0x30U)
#define SBC_UJA_START_UP_RLC_SHIFT           (4U)
#define SBC_UJA_START_UP_RLC_F(x)            ((uint8_t)((uint8_t)(x)<<SBC_UJA_START_UP_RLC_SHIFT)&SBC_UJA_START_UP_RLC_MASK)

/*!
 * @brief   Start-up control register, V2/VEXT start-up control macros.
 */
#define SBC_UJA_START_UP_V2SUC_MASK          (0x08U)
#define SBC_UJA_START_UP_V2SUC_SHIFT         (3U)
#define SBC_UJA_START_UP_V2SUC_F(x)          ((uint8_t)((uint8_t)(x)<<SBC_UJA_START_UP_V2SUC_SHIFT)&SBC_UJA_START_UP_V2SUC_MASK)

/*!
 * @brief   Start-up control register macros.
 */
#define SBC_UJA_START_UP_MASK                (SBC_UJA_START_UP_RLC_MASK | SBC_UJA_START_UP_V2SUC_MASK)
#define SBC_UJA_START_UP_SHIFT               (3U)
#define SBC_UJA_START_UP_F(x)                ((uint8_t)((uint8_t)(x)<<SBC_UJA_START_UP_SHIFT)&SBC_UJA_START_UP_MASK)

/*!
 * @brief   SBC configuration control register, V1 undervoltage threshold
 *          (defined by bit V1RTC) at start-up macros.
 */
#define SBC_UJA_SBC_V1RTSUC_MASK             (0x30U)
#define SBC_UJA_SBC_V1RTSUC_SHIFT            (4U)
#define SBC_UJA_SBC_V1RTSUC_F(x)             ((uint8_t)((uint8_t)(x)<<SBC_UJA_SBC_V1RTSUC_SHIFT)&SBC_UJA_SBC_V1RTSUC_MASK)

/*!
 * @brief   SBC configuration control register,
 *          Forced Normal mode control macros.
 */
#define SBC_UJA_SBC_FNMC_MASK                (0x08U)
#define SBC_UJA_SBC_FNMC_SHIFT               (3U)
#define SBC_UJA_SBC_FNMC_F(x)                ((uint8_t)((uint8_t)(x)<<SBC_UJA_SBC_FNMC_SHIFT)&SBC_UJA_SBC_FNMC_MASK)

/*!
 * @brief   SBC configuration control register,
 *          Software Development mode control macros.
 */
#define SBC_UJA_SBC_SDMC_MASK                (0x04U)
#define SBC_UJA_SBC_SDMC_SHIFT               (2U)
#define SBC_UJA_SBC_SDMC_F(x)                ((uint8_t)((uint8_t)(x)<<SBC_UJA_SBC_SDMC_SHIFT)&SBC_UJA_SBC_SDMC_MASK)

/*!
 * @brief   SBC configuration control register, Sleep control macros.
 */
#define SBC_UJA_SBC_SLPC_MASK                (0x01U)
#define SBC_UJA_SBC_SLPC_SHIFT               (0U)
#define SBC_UJA_SBC_SLPC_F(x)                ((uint8_t)((uint8_t)(x)<<SBC_UJA_SBC_SLPC_SHIFT)&SBC_UJA_SBC_SLPC_MASK)

/*!
 * @brief   SBC configuration control register macros.
 */
#define SBC_UJA_SBC_MASK                     (SBC_UJA_SBC_V1RTSUC_MASK | SBC_UJA_SBC_FNMC_MASK \
                                            | SBC_UJA_SBC_SDMC_MASK| SBC_UJA_SBC_SLPC_MASK)
#define SBC_UJA_SBC_SHIFT                    (0U)
#define SBC_UJA_SBC_F(x)                     ((uint8_t)((uint8_t)(x)<<SBC_UJA_SBC_SHIFT)&SBC_UJA_SBC_MASK)

/*!
 * @brief   MTPNV CRC control register  macros.
 */
#define SBC_UJA_MTPNV_CRC_MASK               (0xFFU)
#define SBC_UJA_MTPNV_CRC_SHIFT              (0U)
#define SBC_UJA_MTPNV_CRC_F(x)               ((uint8_t)((uint8_t)(x)<<SBC_UJA_MTPNV_CRC_SHIFT)&SBC_UJA_MTPNV_CRC_MASK)

/*!
 * @brief   Device identification register macros.
 */
#define SBC_UJA_IDENTIF_MASK                 (0xFFU)
#define SBC_UJA_IDENTIF_SHIFT                (0U)
#define SBC_UJA_IDENTIF_F(x)                 ((uint8_t)((uint8_t)(x)<<SBC_UJA_IDENTIF_SHIFT)&SBC_UJA_IDENTIF_MASK)

#endif /* SOURCES_SBC_UJA_116X_H_ */
